app/controllers/links_controller.rb

INSERT INTO "links" ("link_text", "ranking", "videoid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["link_text", "https://www.youtube.com/watch?v=gO4ZIgHOR50"], ["ranking", ""], ["videoid", ""], ["created_at", 2017-01-26 16:55:36 UTC], ["updated_at", 2017-01-26 16:55:36 UTC]]
---
  def create
    @link = Link.new(link_params)

    respond_to do |format|
      if @link.save

UPDATE "links" SET "link_text" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["link_text", "https://www.youtube.com/watch?v=UmQvqWtDbMc"], ["updated_at", 2017-01-28 17:35:57 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @link.update(link_params)